# IPointCloudEngine Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPointCloudEngine Interface
Members See Also
---
An interface that controls the behavior of the link from Revit to a custom Point Cloud Engine.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public interface IPointCloudEngine
```

Visual Basic
---
```text
Public Interface IPointCloudEngine
```

Visual C++
---
```text
public interface class IPointCloudEngine
```

# Remarks
An instance of this interface should be created by the engine provider and registered with the PointCloudEnginesRegistry. The engine may associated with a particular file name extension during registration (for example, Revit supplies a built-in engine for working with files with the extension "rcs" or "rcp"). Alternatively, the engine may be associated with an identifier which is not expected to the be the extension of a particular file.
# See Also
IPointCloudEngine Members
Autodesk.Revit.DB.PointClouds Namespace